Leafony/platformio-sample-projects/stm32/STM32_Logger_Beacon/src/main.cpp
  for (uint8_t i = 0; i < 12; i++) {
    EEPROM.write(rb_addr + i, data[i]);
    delay(10);  // EEPROM書き込み後しばらく待つ
  }

  // write next ring buffer address to RTC backup register.
  rb_addr += PACKET_LENGTH;

#ifdef DEBUG
  Serial.print("{ temp = ");
  Serial.print(temp);
  Serial.print(", humid = ");
  Serial.print(humid);
  Serial.print(", illum = ");
  Serial.print(illum);
  Serial.print(", batt = ");
  Serial.print(battVolt);
  Serial.println(" }");
  Serial.print("Next ring buffer address: ");
  Serial.println(rb_addr);
  Serial.println("");
#endif
}

/**
 * decode RTC to timestamp.
 */
uint32_t getTimestamp() {
  if (!rtc.isTimeSet()) {
    return 0;
  }

  uint8_t year = rtc.getYear();
  uint8_t month = rtc.getMonth();
  uint8_t day = rtc.getDay();
  uint8_t hours = rtc.getHours();
  uint8_t minutes = rtc.getMinutes();
  uint8_t seconds = rtc.getSeconds();

#ifdef DEBUG
  Serial.print("RTC Timestamp: ");
  Serial.print(year + 2000);
  Serial.print("/");
  Serial.print(month);
  Serial.print("/");
  Serial.print(day);
  Serial.print(" ");
  Serial.print(hours);
  Serial.print(":");
  Serial.print(minutes);
  Serial.print(":");
  Serial.print(seconds);
  Serial.println(" (GMT+0)");
#endif
  DateTime date (year, month, day, hours, minutes, seconds);
  return date.unixtime();
}

/**
 * @brief すべてのデバイスをスリープ
 */
void sleepAll() {
  sleepBLE();
  sleepSensors();

#ifdef DEBUG
  Serial.print(">>> STM32 deepsleep (restart after ");
  Serial.print(sleep_intval);
  Serial.println(" seconds) >>>");
  Serial.flush();
#endif

  LowPower.deepSleep(sleep_intval * 1000);
}

/**
 * @brief 初期化
 */
void setup() {
  Serial.begin(SERIAL_BAUD);
  LowPower.begin(); // Configure low power

  Wire.begin(); // I2C 100KHz
  rtc.begin(); // initialize RTC 24H format

#ifdef DEBUG
  Serial.print("FIRMWARE VERSION: ");
  Serial.println(FIRMWARE_VERSION);
  Serial.print("CPU Clock Frequency = ");
  Serial.println(HAL_RCC_GetHCLKFreq());
  Serial.println("=========================================");
  Serial.println("Setup start.");
#endif

  setupPort();
  setupEEPROM();

#ifdef DEBUG
  Serial.println("Initializing sensors...");
#endif
  setupSensors();
#ifdef DEBUG
  Serial.println("Sensors initialized.");
#endif

  // enable interrupt from accelerometer click event
  LowPower.attachInterruptWakeup(INT_1, onClicked, RISING, DEEP_SLEEP_MODE);

  // enable interrupt from UART RX
  LowPower.enableWakeupFrom(&Serial, wakeupFromUart);

  setupBLE();

#ifdef DEBUG
  Serial.println("Setup finished.");
  Serial.println("=========================================");
#endif
}

/**
 * @brief メインルーチン
 */
void loop() {
  if (!bBleConnected && !bUartInterrupted) { // when BLE is not connected.
#ifdef DEBUG
    Serial.println("<<< Wake up <<<");
#endif

    wakeupSensors();
    wakeupBLE();

#ifdef DEBUG
    Serial.println("<<< Device is ready <<<");
#endif

    readSensors(&dataTemp, &dataHumid, &dataLight, &dataBatt);
#ifdef DEBUG
  Serial.println("");
  Serial.println("--- sensors data ---");
  Serial.println("  Tmp[degC]     = " + String(dataTemp));
  Serial.println("  Hum[%]        = " + String(dataHumid));
  Serial.println("  Lum[lx]       = " + String(dataLight));
  Serial.println("  Bat[V]        = " + String(dataBatt));
  Serial.println("");
#endif

    sleepSensors();

    writeEEPROM();

    StartAdvData();

    if (onClickedFlag) {  // onClicked Interrupt
      onClickedFlag = false;
#ifdef DEBUG
      Serial.println("STM32 on Clicked!");
      Serial.print("Start advertising ");
      Serial.print(click_wake_intval);
      Serial.println(" seconds.");
      Serial.flush();
#endif

      // Continue Advertising; (check BLE status every 0.1 second.)
      for (int i = 0; i < click_wake_intval * 10; i++) {
        delay(100);
        // check ble status; if connection requested, my_evt_le_connection_opend handler is called.
        ble112.checkActivity();
      }

    } else {  // Normal operation
#ifdef DEBUG
      Serial.print("Start advertising (");
      Serial.print(wake_intval);
      Serial.println("s)");
#endif

      // Continue Advertising;
      for (int i = 0; i <= wake_intval * 10; i++) {
        delay(100);
        // don't check activity, if ble is not connectable during normal advertising operation.
        // ble112.checkActivity();
      }

      // bBleConnected turns true at this time, when the connection is requested;
    }

    // when the connection is not requested, shutdown all devices during SLEEP_INTERVAL seconds;
    if (!bBleConnected) {
      // accel.setClick(DOUBLE_TAP, CLICK_THRESHOLD); // Enable Interrupt
      enableAccelInterrupt();  // Enable Interrupt
      sleepAll();
    }
  } else { // when ble is connected or receive send command via uart, this scope will run continuously.
    if (mode == MODE_SEND_DATA_VIA_BLE) {
#ifdef DEBUG
      Serial.println("Start to send data.");
#endif

      delay(500);

      for (uint32_t i = RING_BUFF_START_ADDR; i < RING_BUFF_END_ADDR; i += PACKET_LENGTH) {
        char sendData[PACKET_LENGTH];

        for (int j=0; j<PACKET_LENGTH; j++) {
          sendData[j] = EEPROM.read(i + j);
        }
        ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, PACKET_LENGTH, (const uint8_t *)sendData);
        while (ble112.checkActivity(1000));
      }

      // after all the data transported,
      ble112.ble_cmd_gatt_server_send_characteristic_notification(1, 0x000C, 6, (const uint8_t *)"finish");
      while (ble112.checkActivity(1000));
      mode = MODE_IDLE;
#ifdef DEBUG
      Serial.println("Finish to send data.");
#endif
    }
    else if (mode == MODE_SEND_DATA_VIA_UART) {
      // Empty Serial Rx
      // while(Serial.available()) {
      //   char c = Serial.read();
      //   Serial.print(c);

      //   if (c != 's') {
      //     mode == MODE_IDLE;
      //     return;
      //   }
      // }

#ifdef DEBUG
      Serial.println("Start to send data.");
#endif
      for (uint32_t i = RING_BUFF_START_ADDR; i < RING_BUFF_END_ADDR; i += PACKET_LENGTH) {
        char sendData[PACKET_LENGTH];

        for (int j=0; j<PACKET_LENGTH; j++) {
          sendData[j] = EEPROM.read(i + j);
        }

        // Serial.println(sendData);
        // Serial.flush();

        d_temp = (sendData[0] << 8) + sendData[1];
        d_humid = (sendData[2] << 8) + sendData[3];
        d_illum = (sendData[4] << 8) + sendData[5];
        d_batt = (sendData[6] << 8) + sendData[7];
        d_time = (sendData[8] << 0) + (sendData[9] << 8) + (sendData[10] << 16) + (sendData[11] << 24);

